Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеЗапасовУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеЗапасовУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет табличную часть "Запасы" по всей номенклатуре.
//
&НаСервере
Процедура ЗаполнитьЦеныТабличнойЧастиПоВсейНоменклатуре(ТипЦены)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСправочник.Ссылка КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	Справочник.Номенклатура КАК НоменклатураСправочник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|		ПО НоменклатураСправочник.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура.Ссылка
		|			И (ЦеныНоменклатурыСрезПоследних.ТипЦены = &ТипЦены)
		|ГДЕ
		|	НоменклатураСправочник.ЭтоГруппа = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);	
		
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
    Объект.Запасы.Очистить();

	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Цена = Выборка.Цена;
		НоваяСтрока.Пометка = Истина;

	КонецЦикла;


КонецПроцедуры // ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен()

// Процедура заполняет табличную часть "Запасы" по документу "ПоступлениеЗапасовИУслуг" 
//
&НаСервере
Процедура ЗаполнитьЦеныТабличнойЧастиПоПоступлениюТоваровИУслуг(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеЗапасовУслугЗапасы.Номенклатура,
		|	ПоступлениеЗапасовУслугЗапасы.Цена
		|ИЗ
		|	Документ.ПоступлениеЗапасовУслуг.Запасы КАК ПоступлениеЗапасовУслугЗапасы
		|ГДЕ
		|	ПоступлениеЗапасовУслугЗапасы.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Документ);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	Объект.Запасы.Очистить();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Цена = Выборка.Цена;
		НоваяСтрока.Пометка = Истина;

	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет табличную часть "Запасы" по группе номенклатуре.
//
&НаСервере
Процедура ЗаполнитьЦеныТабличнойЧастиПоГруппеНоменклатуры(ГруппаНоменклатуры, ТипЦены)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСправочник.Ссылка КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	Справочник.Номенклатура КАК НоменклатураСправочник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|		ПО НоменклатураСправочник.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура.Ссылка
		|			И (ЦеныНоменклатурыСрезПоследних.ТипЦены = &ТипЦены)
		|ГДЕ
		|	НоменклатураСправочник.Родитель В ИЕРАРХИИ(&Родитель)
		|	И НоменклатураСправочник.ЭтоГруппа = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
    Объект.Запасы.Очистить();

	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Цена = Выборка.Цена;
		НоваяСтрока.Пометка = Истина;

	КонецЦикла;
	
КонецПроцедуры

// Возвращает истину если есть дублирующиеся строки.
//
&НаСервере
Функция ПроверитьДублиСтрок()
	
	Таблица = Объект.Запасы.Выгрузить();
	ТаблицаНоменклатуры = Таблица.Скопировать(,"Номенклатура,Цена");
	Менеджер=Новый МенеджерВременныхТаблиц;
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|    ТаблицаНоменклатуры.Номенклатура,
	|    ТаблицаНоменклатуры.Цена
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|    &ТаблицаНоменклатуры КАК ТаблицаНоменклатуры";
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры",ТаблицаНоменклатуры);
	Запрос.МенеджерВременныхТаблиц=Менеджер;
	Результат=Запрос.Выполнить();
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Счетчик
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|		СУММА(1) КАК Счетчик
	|	ИЗ
	|		ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаНоменклатуры.Номенклатура) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Счетчик > 1";
	
	Результат=Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Дубли = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Дублируется строка: %Номенклатура%!';uk='Дублюється рядок: %Номенклатура%!'");
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Номенклатура%", Выборка.Номенклатура);
		Сообщение.Сообщить();
		Дубли = Истина;
		
	КонецЦикла;
		
	Возврат Дубли;
		
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
 	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки

КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Дубли = ПроверитьДублиСтрок();
	
	Если Дубли Тогда
		
		Сообщить(НСтр("ru='Запись документа отменена! Удалите дублирующиеся строки.';uk='Запис документу скасований! Видаліть рядки, що дублюються.'"));
		Отказ = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ТАБЛИЧНЫХ ЧАСТЕЙ ФОРМЫ

// Процедура - обработчик нажатия на кнопку ЗаполнитьПоВсейНоменклатуре.
//
&НаКлиенте
Процедура ЗаполнитьПоВсейНоменклатуре(Команда)
	
	Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції?'"), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТипЦенЗаполнения = Объект.ТипЦен;
	
	Если ЗначениеЗаполнено(ТипЦенЗаполнения) Тогда
		ЗаполнитьЦеныТабличнойЧастиПоВсейНоменклатуре(ТипЦенЗаполнения);
	Иначе
		Предупреждение("Таблица не может быть заполнена! Укажите тип цены.");
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик нажатия на кнопку ЗаполнитьПоПоступлениюТоваровИУслуг.
//
&НаКлиенте
Процедура ЗаполнитьПоПоступлениюТоваровИУслуг(Команда)
	
	Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції?'"), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПоступлениеЗапасовИУслуг = ОткрытьФормуМодально("Документ.ПоступлениеЗапасовУслуг.Форма.ФормаВыбора");
	
	Если ЗначениеЗаполнено(ПоступлениеЗапасовИУслуг) Тогда
		ЗаполнитьЦеныТабличнойЧастиПоПоступлениюТоваровИУслуг(ПоступлениеЗапасовИУслуг);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик нажатия на кнопку ЗаполнитьПоГруппеНоменклатуры.
//
&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	
	Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції?'"), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаНоменклатуры = ОткрытьФормуМодально("Справочник.Номенклатура.Форма.ФормаВыбораГруппы");
	ТипЦенЗаполнения = Объект.ТипЦен;
	
	Если ЗначениеЗаполнено(ГруппаНоменклатуры) И ЗначениеЗаполнено(ТипЦенЗаполнения) Тогда
		ЗаполнитьЦеныТабличнойЧастиПоГруппеНоменклатуры(ГруппаНоменклатуры, ТипЦенЗаполнения);
	Иначе
		Предупреждение("Таблица не может быть заполнена! Укажите тип цены.");
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик нажатия на кнопку Очистить.
//
&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	
	Объект.Запасы.Очистить();
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку СнятьПометки.
//
&НаКлиенте
Процедура СнятьПометки(Команда)
	
	 Для каждого Строка Из Объект.Запасы Цикл
	 
	 	 Строка.Пометка = Ложь;
	 
	 КонецЦикла;
	 
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку ПоставитьПометки.
//
&НаКлиенте
Процедура ПоставитьПометки(Команда)
	
	 Для каждого Строка Из Объект.Запасы Цикл
	 
	 	 Строка.Пометка = Истина;
	 
	 КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ДЛЯ ИЗМЕНЕНИЯ ЦЕН

// Процедура - обработчик нажатия на кнопку ИзменитьНаПроцент.
//
&НаКлиенте
Процедура ИзменитьНаПроцент(Команда)
	
	ТекущаяФормула = "ИзменитьНаПроцент";
	Элементы.ФормулаСумма.Видимость = Ложь;
	Элементы.ФормулаПроцент.Видимость = Истина;
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку ИзменитьНаСумму.
//
&НаКлиенте
Процедура ИзменитьНаСумму(Команда)
	
	ТекущаяФормула = "ИзменитьНаСумму";
	Элементы.ФормулаСумма.Видимость = Истина;
	Элементы.ФормулаПроцент.Видимость = Ложь;

КонецПроцедуры

// Процедура - обработчик нажатия на кнопку Выполнить.
//
&НаКлиенте
Процедура Изменить(Команда)
	
	Для каждого Строка Из Объект.Запасы Цикл
		
		Если Строка.Пометка Тогда
			
			Если ТекущаяФормула = "ИзменитьНаСумму" И Знак="+" Тогда
				
				Строка.Цена = Строка.Цена + Сумма;
				
			ИначеЕсли ТекущаяФормула = "ИзменитьНаСумму" И Знак="-" Тогда
				
				Строка.Цена = Строка.Цена - Сумма;
				
			ИначеЕсли ТекущаяФормула = "ИзменитьНаПроцент" И Знак="+" Тогда
				
				Строка.Цена = Строка.Цена + (Строка.Цена*Процент/100);
				
			ИначеЕсли ТекущаяФормула = "ИзменитьНаПроцент" И Знак="-" Тогда
				
				Строка.Цена = Строка.Цена - (Строка.Цена*(Процент*0.01));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
